starterGrill_Jiacheng/app/views/reservations/index.html.erb

  <% @reservations.each do |reservation| %>
    <% user = User.find(reservation.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1