starterGrill_Jiacheng/app/views/users/show.html.erb

  <% @reservations.each do |reservation| %>
    <% user = User.find(reservation.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]