starterGrill_Jiacheng/app/controllers/foods_controller.rb

  def menu
    @starters = Food.where(:food_type => :starters)
---
SELECT "foods".* FROM "foods" WHERE "foods"."food_type" = 'starters'