starterGrill_Jiacheng/app/controllers/reservations_controller.rb

  def index
    @reservations = Reservation.where('date BETWEEN ? AND ?', DateTime.now.beginning_of_day, DateTime.now.end_of_day).all
---
SELECT "reservations".* FROM "reservations" WHERE (created_at BETWEEN '2013-06-09 05:00:00' AND '2013-06-10 04:59:59')

  def edit
    @reservation = Reservation.find(params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", "3"]]

  def create
    @reservation = Reservation.new(params[:reservation])
    @reservation.user_id = current_user.id
    @reservation.save
---
INSERT INTO "reservations" ("created_at", "date", "guest_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 25 May 2013 10:57:08 UTC +00:00], ["date", Sat, 25 May 2013], ["guest_number", 2], ["updated_at", Sat, 25 May 2013 10:57:08 UTC +00:00], ["user_id", 5]]

  def update
    @reservation = Reservation.find(params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", "15"]]

  def destroy
    @reservation = Reservation.find(params[:id])
    @reservation.destroy
---
SELECT "reservations".* FROM "reservations" WHERE "reservations"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "reservations" WHERE "reservations"."id" = ?  [["id", 6]]