starterGrill_Jiacheng/app/controllers/users_controller.rb

  def show
    if(signed_in?)
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'Mike', "email" = 'mike@gmail.com', "password_digest" = '$2a$10$Gao7MVtF4RDkffGkxXF7DO1B.vKdLsEHBMtVx5G/SYX5.sYhYX8ZO', "updated_at" = '2013-05-24 19:07:20.446971' WHERE "users"."id" = 1